// We'll use this interface for our article data
export interface Article {
  id: number;
  title: string;
  description: string;
  content?: string;
  category: string | null;
  date: string;
  time: string;
  image: string;
}

// Mock data for all articles
export const allArticles: Article[] =[
  {
    id: 1,
    title: 'قصة شاب ليبي يدّخر ثروة عبر الاستثمار في الذهب',
    description:
      'تمكن شاب ليبي يعمل في محل أحذية من ادخار 200 ألف دينار خلال 8 سنوات عبر الاستثمار في الذهب.',
    content:
      'الشاب ياسين الرميلي عمره 30 سنة يشتغل في محل أحذية بشارع أول سبتمبر منذ عام 2017. تمكن من تخزين 80% من راتبه على مر هذه السنين ويقول: "اليوم تمكنت من ادخار مبلغ 200 ألف دينار بعد ثمانية سنوات شغل توكة كاملة بمرتب 1400 دينار، والسبب هو أني في كل سنة تمر كنت أشتري بأموالي كاملة مجوهرات ذهب (وهي نصيحة من أبي رحمه الله)."\n\nويضيف: "في كل عام، وفي شهر ديسمبر بالتحديد، أشتري بما يقارب 13 ألف دينار ذهب من سوق الذهب. والحمد لله بارتفاع الذهب تمكنت من حصد 200 ألف دينار كاملة، بينما كانت أموالي ستكون فقط 93 ألف دينار في حال تركتها كما هي ولم أستثمر في الذهب، بل كانت ستكون أقل بكثير لانخفاض قيمة الدينار بشكل كبير وأيضًا بسبب سحب فئات الأوراق النقدية هذا العام والذي ألحق الضرر بكثير من أصدقائي."\n\nوفي ختام حديثه قال: "أحببت أن أشارك معكم قصتي وأتمنى لكم جميعًا التوفيق. أدعو لي بالنجاح شكرًا."',
    category: null,
    date: '22 أكتوبر 2025',
    time: '10:20',
    image: 'https://scontent-lhr6-2.xx.fbcdn.net/v/t39.30808-6/558848079_1216491667181756_5524759063881830872_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=833d8c&_nc_ohc=N__k0rWeteMQ7kNvwHp9KBJ&_nc_oc=AdkQad7elRtff5oIGOOXGmyS0f9PZgVTXM1zN9iYgMiIrUe_9w1wR6tACMebs8kC3IW7HhtNPadxUZB6CZ_KN52p&_nc_zt=23&_nc_ht=scontent-lhr6-2.xx&_nc_gid=2txDFWMr21eTm2M-yag93A&oh=00_Afd6ER9hZeRQLfe6EKXNbMlZkfkGI0bJp3D03CaGTfzzpQ&oe=690AF47B'
  },
  {
    id: 2,
    title: 'ليبي مغترب في بريطانيا يشارك معاناته ويطلب النصيحة',
    description:
      'شاب ليبي يروي تجربة العيش والعمل في بريطانيا منذ عام 2018 ومعاناته مع الغربة وعدم القدرة على الادخار.',
    content:
      'الشاب حمدي النمر يقول: "وصلت بريطانيا عام 2018 دخلت عن طريق فرنسا وتوقعت أنني سأعيش حياة هنيئة وكنت جاهز حتى أني استلم وظيفة غسل صحون في مطعم وقلت هذه بداية كل شاب مغترب وبعدها يتحسن الحال!"\n\nويتابع: "ولكن للأسف استمرّ بي الحال أتنقل من خدمة لخدمة وأحاول فقط أن ألحق على مصروفي وأنجو من بريطانيا وغلائها. اشتغلت مع عراقيين في مجال تنظيف سيارات، واشتغلت مع ليبيين في ورشة ومحلات كباب، واشتغلت مع إنجليز، وفي كل مرة وظيفة مختلفة من الأعمال الحرة وفي كل مرة تحدث مشاكل بيني وبين الذي يشغّلني.. وأترك."\n\nويضيف: "لم أجد وقت لإكمال دراستي، ولم أجد وقت لادخار المال، ولم أجد وقت حتى للتفكير في الزواج، ومرت بي السنين. أنا الآن أدخل عامي الـ29 ولم يتغير شيء سوى أنني أعيش في بلد منظم بارد، متقدم ومحترم لكن معزول وغالي جدًا وضرائبه عالية وشعبه بارد."\n\nوفي النهاية قال: "الآن وصلت لمرحلة أسأل نفسي هل أبقى في بريطانيا أو أعود لليبيا وأترك كل شيء هناك وأبدأ حياتي من جديد؟ إن شاء الله حتى نقرّي إنجليزي للناس وتتحسن لغتها. هلكتني الغربة والعزلة وأريد أن أستقر بجانب عائلتي. شكرا لقراءتكم وأتمنى نصائحكم."',
    category: null,
    date: '23 أكتوبر 2025',
    time: '13:05',
    image: 'https://scontent-lhr8-1.xx.fbcdn.net/v/t39.30808-6/570162476_1217418090422447_8274298560014262761_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=833d8c&_nc_ohc=pUdcZhcaPPcQ7kNvwGwVMjO&_nc_oc=Admd3NVbxVnftE3pPIJhX7hJc8Qtm5cZoAsjT8IJCF9Lcwe-mUQW73SpsSGO4Sn0YATBarBhRK_xdO4IGaxdh5BJ&_nc_zt=23&_nc_ht=scontent-lhr8-1.xx&_nc_gid=pNuRhNS280BY5IcUUuP-qQ&oh=00_Afe7r5xn6tTijXKdIjaIEgdDKMFmFjFpBF6GKasNBCLolQ&oe=690AE16B'
  },
  {
    id: 3,
    title: 'شاب ليبي يدخل غيبوبة بعد حادث دراجة نارية في مالطا',
    description:
      'شاب في مقتبل العمر يتعرض لحادث خطير في مالطا ويدخل في غيبوبة منذ ثلاثة أيام.',
    content:
      'الشاب محمد الكالوش، يبلغ من العمر 21 سنة، يعيش في مالطا، تعرض قبل ثلاثة أيام لحادث عنيف إثر ارتطام دراجته النارية بسيارة أخرى. تم إسعافه على الفور ونقله إلى المستشفى، إلا أنه دخل في غيبوبة ولم يستيقظ منها حتى الآن.\n\nأصدقاؤه وأقاربه يطلبون الدعاء له بالشفاء العاجل، فهو شاب في مقتبل العمر ولم تبدأ حياته بعد. 🇲🇹',
    category: null,
    date: '31 أكتوبر 2025',
    time: '22:10',
    image: 'https://scontent-lhr6-2.xx.fbcdn.net/v/t39.30808-6/573996956_1223122076518715_4519199366682274432_n.jpg?stp=dst-jpg_s1080x2048_tt6&_nc_cat=105&ccb=1-7&_nc_sid=833d8c&_nc_ohc=mSzmhb0DQ6QQ7kNvwHPK4Fy&_nc_oc=AdlcHJLD7PA5z4ZawhA_ttHNB2pj3HRhHsQhQyf2uY7516nr-KUFazoj-suQISPy-74k-AlMKarVcojCi1MrxYhu&_nc_zt=23&_nc_ht=scontent-lhr6-2.xx&_nc_gid=pOTVN8F1ZVUgse3FfCNPAg&oh=00_Afe475RJUHJB1hRTTFOeQFSolQyB8uyaJctP2K0MsxuG6Q&oe=690B0F16'
  }
];
